
Функция ОтправитьЗапрос(ТекстЗапроса, Пользователь) Экспорт
	
	Соединение = Новый HTTPСоединение(Константы.DialogИмяСервера.Получить(), , , , , , Новый ЗащищенноеСоединениеOpenSSL());
	
	АдресРесурса = "dialogflow";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("dialog-token", Константы.DialogDialogToken.Получить());
	
	Данные = ДанныеЗапроса(ТекстЗапроса, Пользователь);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSONИзЗначения(Данные));
	Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	ДанныеОтвета = ЗначениеИзJSONСтроки(Ответ.ПолучитьТелоКакСтроку());
	Возврат ДанныеОтвета.answer;
	
КонецФункции

Функция ДанныеЗапроса(ТекстЗапроса, Пользователь)
	
	Данные = Новый Структура;
	Данные.Вставить("query", ТекстЗапроса);
	Данные.Вставить("sessionId", Пользователь.Код);
	Данные.Вставить("payload", payload(Пользователь));
	Возврат Данные;
	
КонецФункции

Функция payload(Пользователь)
	
	Данные = Новый Структура;
	Данные.Вставить("name", Пользователь.Наименование);
	Данные.Вставить("email", Пользователь.DialogID);
	Возврат Данные;
	
КонецФункции
