
Процедура СохранитьВJSON(Значение, ПутьКФайлу) Экспорт
	
	Текст = ЗначениеВJSON(Значение);
	СохранитьТекст(Текст, ПутьКФайлу);

КонецПроцедуры

Функция ПрочитатьИзJSON(ПутьКФайлу) Экспорт
	
	Текст = ПрочитатьТекст(ПутьКФайлу);
	Возврат ЗначениеИзJSON(Текст);

КонецФункции


Функция ЗначениеВJSON(Знач Значение)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ЗначениеИзJSON(Знач Строка)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Возврат Результат;

КонецФункции

Процедура СохранитьТекст(Текст, ИмяФайла) Экспорт
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(Текст);
	ЗаписьТекста.Закрыть();

КонецПроцедуры

Функция ПрочитатьТекст(ИмяФайла)
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайла);
	Текст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	Возврат Текст;

КонецФункции
