#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Пользователь(user) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	DialogDemoUsers.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.DialogDemoUsers КАК DialogDemoUsers
	|ГДЕ
	|	DialogDemoUsers.user = &user";
	Запрос.УстановитьПараметр("user", user);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
	Иначе
		Пользователь = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Пользователь;
	
КонецФункции

#КонецОбласти

#КонецЕсли
