#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ИмяБазы(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	DialogDemoБазы.ИмяБазы КАК ИмяБазы
	|ИЗ
	|	РегистрСведений.DialogDemoБазы КАК DialogDemoБазы
	|ГДЕ
	|	DialogDemoБазы.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИмяБазы = Выборка.ИмяБазы;
	Иначе
		ИмяБазы = "";
	КонецЕсли;
	
	Возврат ИмяБазы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
